Craix/Praca-Inzynierska/PI_OKDO_E1/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN 0x0100u /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u        /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INV_DI 0x00u       /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u   /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_FAST 0x40u    /*!<@brief Fast mode, slew rate control is disabled */

/*! @name PIO0_29 (number 92), DEBUG_UART_RX
  @{ */
#define BOARD_INIT_DEBUG_DEBUG_UART_RX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_DEBUG_DEBUG_UART_RX_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INIT_DEBUG_DEBUG_UART_RX_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_30 (number 94), DEBUG_UART_TX
  @{ */
#define BOARD_INIT_DEBUG_DEBUG_UART_TX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_DEBUG_DEBUG_UART_TX_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INIT_DEBUG_DEBUG_UART_TX_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_INIT_DEBUG(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_20_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 5. */
#define PIO1_20_FUNC_ALT5 0x05u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_20_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_21_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 5. */
#define PIO1_21_FUNC_ALT5 0x05u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_21_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_6_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_6_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_6_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_6_SLEW_FAST 0x01u

/*! @name PIO1_21 (number 30), MPU6050_SDA
  @{ */
#define BOARD_INIT_MPU6050_MPU6050_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_MPU6050_MPU6050_SDA_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INIT_MPU6050_MPU6050_SDA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO1_20 (number 4), MPU6050_SCL
  @{ */
#define BOARD_INIT_MPU6050_MPU6050_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_MPU6050_MPU6050_SCL_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INIT_MPU6050_MPU6050_SCL_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO1_6 (number 5), MPU6050_INT
  @{ */
#define BOARD_INIT_MPU6050_MPU6050_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_MPU6050_MPU6050_INT_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INIT_MPU6050_MPU6050_INT_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_INIT_MPU6050(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_15_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_15_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO0_15_MODE_PULL_UP 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_15_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_5_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_5_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO1_5_MODE_PULL_UP 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_5_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_8_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_8_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO1_8_MODE_PULL_UP 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_8_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_9_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_9_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO1_9_MODE_PULL_UP 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_9_SLEW_FAST 0x01u

