Craix/Praca-Inzynierska/PI_OKDO_E1/board/pin_mux.h
/*! @name PIO1_5 (number 31), ENCA_CLK
  @{ */
#define BOARD_INIT_ENC_ENCA_CLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_ENC_ENCA_CLK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INIT_ENC_ENCA_CLK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_9 (number 10), ENCB_CLK
  @{ */
#define BOARD_INIT_ENC_ENCB_CLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_ENC_ENCB_CLK_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INIT_ENC_ENCB_CLK_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_15 (number 22), ENCA_ST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_ENC_ENCA_ST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_ENC_ENCA_ST_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INIT_ENC_ENCA_ST_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_ENC_ENCA_ST_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INIT_ENC_ENCA_ST_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_8 (number 24), ENCB_ST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_ENC_ENCR_ST_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_ENC_ENCR_ST_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INIT_ENC_ENCR_ST_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_ENC_ENCR_ST_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INIT_ENC_ENCR_ST_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_INIT_ENC(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_26_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief
 * Driver slew rate.
 * : Standard-mode, output slew rate is slower.
 * More outputs can be switched simultaneously.
 */
#define PIO0_26_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_1_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 5. */
#define PIO1_1_FUNC_ALT5 0x05u
/*!
 * @brief
 * Driver slew rate.
 * : Standard-mode, output slew rate is slower.
 * More outputs can be switched simultaneously.
 */
#define PIO1_1_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_26_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_26_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_26_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Standard-mode, output slew rate is slower.
 * More outputs can be switched simultaneously.
 */
#define PIO1_26_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_27_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_27_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_27_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Standard-mode, output slew rate is slower.
 * More outputs can be switched simultaneously.
 */
#define PIO1_27_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_2_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 6. */
#define PIO1_2_FUNC_ALT6 0x06u
/*!
 * @brief
 * Driver slew rate.
 * : Standard-mode, output slew rate is slower.
 * More outputs can be switched simultaneously.
 */
#define PIO1_2_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_3_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 6. */
#define PIO1_3_FUNC_ALT6 0x06u

/*! @name PIO1_1 (number 59), LCD_SSEL1
  @{ */
#define BOARD_INIT_LCD_LCD_SSEL1_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_LCD_LCD_SSEL1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INIT_LCD_LCD_SSEL1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_2 (number 61), LCD_SCK
  @{ */
#define BOARD_INIT_LCD_LCD_SCK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_LCD_LCD_SCK_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INIT_LCD_LCD_SCK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_26 (number 60), LCD_MOSI
  @{ */
#define BOARD_INIT_LCD_LCD_MOSI_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_LCD_LCD_MOSI_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INIT_LCD_LCD_MOSI_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_27 (number 85), LCD_DC
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_LCD_LCD_DC_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_LCD_LCD_DC_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INIT_LCD_LCD_DC_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_LCD_LCD_DC_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INIT_LCD_LCD_DC_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_26 (number 68), LCD_RST
  @{ */

