Craix/Praca-Inzynierska/PI_OKDO_E1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INIT_LCD_LCD_RST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_LCD_LCD_RST_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INIT_LCD_LCD_RST_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_LCD_LCD_RST_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INIT_LCD_LCD_RST_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_INIT_LCD(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_31_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_31_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_31_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_31_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_7_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_7_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_7_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_7_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_0_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_0_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_0_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_0_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_10_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_10_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_10_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_10_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_4_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO1_4_FUNC_ALT3 0x03u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_4_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_7_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO1_7_FUNC_ALT3 0x03u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_7_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_7_SLEW_FAST 0x01u

/*! @name PIO1_7 (number 9), PWM_BR
  @{ */
#define PBOARD_INIT_ENGINE_PWM_BR_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PBOARD_INIT_ENGINE_PWM_BR_PIN 7U                   /*!<@brief PORT pin number */
#define PBOARD_INIT_ENGINE_PWM_BR_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_7 (number 6), BIN_R
  @{ */

/* Symbols to be used with GPIO driver */
#define PBOARD_INIT_ENGINE_BIN_R_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PBOARD_INIT_ENGINE_BIN_R_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define PBOARD_INIT_ENGINE_BIN_R_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define PBOARD_INIT_ENGINE_BIN_R_PIN 7U                   /*!<@brief PORT pin number */
#define PBOARD_INIT_ENGINE_BIN_R_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_0 (number 11), BIN_L
  @{ */

/* Symbols to be used with GPIO driver */
#define PBOARD_INIT_ENGINE_BIN_L_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define PBOARD_INIT_ENGINE_BIN_L_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define PBOARD_INIT_ENGINE_BIN_L_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define PBOARD_INIT_ENGINE_BIN_L_PIN 0U                   /*!<@brief PORT pin number */
#define PBOARD_INIT_ENGINE_BIN_L_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_31 (number 23), AIN_L
  @{ */

/* Symbols to be used with GPIO driver */
#define PBOARD_INIT_ENGINE_AIN_L_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PBOARD_INIT_ENGINE_AIN_L_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define PBOARD_INIT_ENGINE_AIN_L_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define PBOARD_INIT_ENGINE_AIN_L_PIN 31U                   /*!<@brief PORT pin number */
#define PBOARD_INIT_ENGINE_AIN_L_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_10 (number 40), Ain_R
  @{ */

