Craix/Praca-Inzynierska/PI_OKDO_E1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PBOARD_INIT_ENGINE_AIN_R_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define PBOARD_INIT_ENGINE_AIN_R_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define PBOARD_INIT_ENGINE_AIN_R_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define PBOARD_INIT_ENGINE_AIN_R_PIN 10U                   /*!<@brief PORT pin number */
#define PBOARD_INIT_ENGINE_AIN_R_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PBOARD_INIT_ENGINE(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_23_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_23_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO0_23_MODE_PULL_UP 0x02u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_23_SLEW_FAST 0x01u

/*! @name PIO0_23 (number 20), BUTTON
  @{ */
#define BOARD_INIT_BUTTON_INT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_BUTTON_INT_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INIT_BUTTON_INT_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_23 (number 20), BUTTON
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_BUTTON_GPIO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_BUTTON_GPIO_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INIT_BUTTON_GPIO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_BUTTON_GPIO_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INIT_BUTTON_GPIO_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_INIT_BUTTON(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief
 * Analog switch input control.
 * : For all pins except PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9 analog switch is
 * closed (enabled).
 */
#define PIO0_16_ASW_VALUE1 0x01u
/*!
 * @brief Select Digital mode.: Disable digital mode. Digital input set to 0. */
#define PIO0_16_DIGIMODE_ANALOG 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_16_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_16_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_16_SLEW_FAST 0x01u

/*! @name PIO0_16 (number 14), ADC_BATTERY
  @{ */
#define BOARD_INIT_ADC_ADC_BATTERY_GPIO GPIO                 /*!<@brief GPIO device name: GPIO */
#define BOARD_INIT_ADC_ADC_BATTERY_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_ADC_ADC_BATTERY_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INIT_ADC_ADC_BATTERY_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_INIT_ADC(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
